In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import math as m
import pandas_datareader.data as web

In [6]:
df1 = pd.read_csv('examples/ex1.csv',sep='/')
df1

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [9]:
res = pd.read_table('examples/ex3.txt',sep = '\s+')
res

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [12]:
df2 = pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
df3 = pd.read_csv('examples/ex5.csv')
df3

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
df4 = pd.read_csv('examples/ex5.csv',na_values=['NULL'])
df4

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
df5 = pd.read_csv('examples/ex5.csv')
df5.to_csv('examples/my_out_of_ex5.csv',na_rep='ToBeReplaced')

In [26]:
df5 = pd.read_csv('examples/ex5.csv')
df5.to_csv('examples/my_out_of_ex5.csv',na_rep='ToBeReplaced',index=False,header=False)

In [27]:
df5 = pd.read_csv('examples/ex5.csv')
df5.to_csv('examples/my_out_of_ex5.csv',na_rep='ToBeReplaced',index=False,columns=['a','b','c'])